app/controllers/memberships_controller.rb

SELECT "memberships".* FROM "memberships" WHERE "memberships"."id" = $1 LIMIT 1  [["id", "1"]]
---
    def set_membership
      @membership = Membership.find(params[:id])