app/controllers/organizations_controller.rb

  def index
    @organizations = Organization.all
---
SELECT "organizations".* FROM "organizations"

  def show
    @organization = Organization.find(params[:id])
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @organization = Organization.new(organization_params)
    respond_to do |format|
      if @organization.save
---
INSERT INTO "organizations" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Mon, 09 Sep 2013 08:20:09 UTC +00:00], ["name", "techhub"], ["updated_at", Mon, 09 Sep 2013 08:20:09 UTC +00:00]]

  def destroy
    @organization.destroy
---
DELETE FROM "organizations" WHERE "organizations"."id" = $1  [["id", 1]]

    def set_organization
      @organization = Organization.find(params[:id])
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT 1  [["id", "1"]]