app/controllers/permission_sets_controller.rb

SELECT "permission_sets".* FROM "permission_sets" WHERE "permission_sets"."id" = $1 LIMIT 1  [["id", "edit"]]
---
    def set_permission_set
      @permission_set = PermissionSet.find(params[:id])