app/controllers/registrations_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 6 ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "users"."id" = 7  [["encrypted_password", "$2a$04$44cSXEJ9tfk67gKfjQfNku6LcqQbVu.Gpq22zjDDoxYvuYaPxdMIG"], ["updated_at", Fri, 06 Sep 2013 08:28:50 UTC +00:00]]
---
  def update
    @user = User.find(current_user.id)
    successfully_updated = if needs_password?(@user, params)
      @user.update_with_password(devise_parameter_sanitizer.for(:account_update))