app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
---
	  def show
	  	user_id = params[:id] || current_user.id
	    @user = User.find(user_id)