app/controllers/users/omniauth_callbacks_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'jon@example.com' LIMIT 1
INSERT INTO "omniauth_identities" ("created_at", "provider", "uid", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Fri, 06 Sep 2013 08:28:50 UTC +00:00], ["provider", "twitter"], ["uid", "123456"], ["updated_at", Fri, 06 Sep 2013 08:28:50 UTC +00:00], ["user_id", 3]]
INSERT INTO "users" ("created_at", "email", "encrypted_password", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "last_sign_in_at" = $1, "current_sign_in_at" = $2, "last_sign_in_ip" = $3, "current_sign_in_ip" = $4, "sign_in_count" = $5, "updated_at" = $6 WHERE "users"."id" = 3
---
  def new_with_omniauth
    email = params[:user][:email]
    name = params[:user][:name]
    password = params[:user][:password]
    @provider = params[:provider]
    @uid = params[:uid]

    @user = User.find_by_email(email)
    if @user
      if @user.valid_password?(password)
        @user.omniauth_identities.create(:provider => @provider, :uid => @uid)
        flash[:success] = 'Sign in via ' + PROVIDERS[@provider] + ' has been added to your account. Signed in successfully!'
        sign_in_and_redirect(:user, @user)
      else
        @user = User.new(name:name, email:email)
        flash[:error] = 'Password incorrect!'
        render 'devise/registrations/new_with_omniauth'
      end
    else
      @user = User.new(name: name, email: email, password: password, password_confirmation: password)
      if @user.save